artilleryTests/rosetta-load-test.yml
config:
  target: http://127.0.0.1:8082
  payload:
    path: 'data.csv'
    fields:
      - 'address'
      - 'block'
      - 'unsigned_transaction'
      - 'signed_transaction'
      - 'transaction_size'
      - 'relative_ttl'
      - 'signed_hash_transaction'
      - 'hex_bytes'
  ensure:
    thresholds:
      - vusers.failed: 1
  http:
    timeout: 120
    defaults:
      headers:
        Content-Type: application/json
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: { }
    expect:
      expectDefault200: true
      outputFormat: silent
      reportFailuresAsErrors: true
    metrics-by-endpoint:
      useOnlyRequestNames: true
      metricsNamespace: "latency_metrics"
scenarios:
  - name : Network status test
    flow:
      - post:
          url: '/network/status'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "metadata": {}
            }
  - name: "Account balance test"
    flow:
      - post:
          url: '/account/balance'
          body: |
            {
                "network_identifier": {
                    "blockchain": "cardano",
                    "network": "preprod"
                },
                "account_identifier": {
                    "address": "{{ address }}"
                }
            }
  - name: "Block test"
    flow:
      - post:
          url: '/block'
          body: |
              {
                  "network_identifier": {
                      "blockchain": "cardano",
                      "network": "preprod"
                  },
                  "block_identifier": {
                      "index": {{ block }}
                  }
              }
  - name: "Construction parse unsigned transaction"
    flow:
      - post:
          url: '/construction/parse'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "signed": false,
              "transaction": "{{ unsigned_transaction }}"
            }
  - name: "Construction parse signed transaction"
    flow:
      - post:
          url: '/construction/parse'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "signed": true,
              "transaction": "{{ signed_transaction }}"
            }
  - name: "Construction combine test"
    flow:
      - post:
          url: '/construction/combine'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "unsigned_transaction": "{{ unsigned_transaction }}",
              "signatures": [
                {
                  "signing_payload": {
                    "account_identifier": {
                      "address": "Ae2tdPwUPEZC6WJfVQxTNN2tWw4skGrN6zRVukvxJmTFy1nYkVGQBuURU3L",
                      "metadata": {
                        "chain_code": "dd75e154da417becec55cdd249327454138f082110297d5e87ab25e15fad150f"
                      }
                    },
                    "hex_bytes": "4691ebf945f37962153f74e198ba2553177e6dc8e464303e37589077f634397c",
                    "signature_type": "ed25519"
                  },
                  "public_key": {
                    "hex_bytes": "73fea80d424276ad0978d4fe5310e8bc2d485f5f6bb3bf87612989f112ad5a7d",
                    "curve_type": "edwards25519"
                  },
                  "signature_type": "ed25519",
                  "hex_bytes": "dc2a1948bfa9411b37e8d280b04c48a85af5588bcf509c0fca798f7b462ebca92d6733dacc1f1c6c1463623c085401be07ea422ad4f1c543375e7d3d2393aa0b"
                }
              ]
            }
  - name: "Construction payloads test"
    flow:
      - post:
          url: '/construction/payloads'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "operations": [
                {
                  "operation_identifier": {
                    "index": 0,
                    "network_index": 0
                  },
                  "type": "input",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "-90000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  },
                  "coin_change": {
                    "coin_identifier": {
                      "identifier": "2f23fd8cca835af21f3ac375bac601f97ead75f2e79143bdf71fe2c4be043e8f:1"
                    },
                    "coin_action": "coin_spent"
                  }
                },
                {
                  "operation_identifier": {
                    "index": 1
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "10000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 2
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "40000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 3
                  },
                  "type": "stakeKeyDeregistration",
                  "status": "success",
                  "account": {
                    "address": "stake1uxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7caek7a5"
                  },
                  "metadata": {
                    "staking_credential": {
                      "hex_bytes": "1B400D60AAF34EAF6DCBAB9BBA46001A23497886CF11066F7846933D30E5AD3F",
                      "curve_type": "edwards25519"
                    }
                  }
                }
              ],
              "metadata": {
                "ttl": "0",
                "protocol_parameters": {
                  "coinsPerUtxoSize": "0",
                  "maxTxSize": 16384,
                  "maxValSize": 0,
                  "keyDeposit": "2000000",
                  "maxCollateralInputs": 0,
                  "minFeeCoefficient": 44,
                  "minFeeConstant": 155381,
                  "minPoolCost": "340000000",
                  "poolDeposit": "500000000",
                  "protocol": 4
                }
              }
            }
  - name: "Construction payloads test with byron input"
    flow:
      - post:
          url: '/construction/payloads'
          body: |
            {
                "network_identifier": {
                    "blockchain": "cardano",
                    "network": "preprod"
                },
                "operations": [
                    {
                        "operation_identifier": {
                            "index": 0,
                            "network_index": 0
                        },
                        "type": "input",
                        "status": "success",
                        "account": {
                            "address": "Ae2tdPwUPEZC6WJfVQxTNN2tWw4skGrN6zRVukvxJmTFy1nYkVGQBuURU3L"
                        },
                        "amount": {
                            "value": "-90000",
                            "currency": {
                                "symbol": "ADA",
                                "decimals": 6
                            }
                        },
                        "coin_change": {
                            "coin_identifier": {
                                "identifier": "2f23fd8cca835af21f3ac375bac601f97ead75f2e79143bdf71fe2c4be043e8f:1"
                            },
                            "coin_action": "coin_spent"
                        }
                    },
                    {
                        "operation_identifier": {
                            "index": 1
                        },
                        "related_operations": [
                            {
                                "index": 0
                            }
                        ],
                        "type": "output",
                        "status": "success",
                        "account": {
                            "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                        },
                        "amount": {
                            "value": "10000",
                            "currency": {
                                "symbol": "ADA",
                                "decimals": 6
                            }
                        }
                    },
                    {
                        "operation_identifier": {
                            "index": 2
                        },
                        "related_operations": [
                            {
                                "index": 0
                            }
                        ],
                        "type": "output",
                        "status": "success",
                        "account": {
                            "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                        },
                        "amount": {
                            "value": "40000",
                            "currency": {
                                "symbol": "ADA",
                                "decimals": 6
                            }
                        }
                    }
                ],
                "metadata": {
                    "ttl": "1000",
                    "protocol_parameters": {
                      "coinsPerUtxoSize": "0",
                      "maxTxSize": 16384,
                      "maxValSize": 0,
                      "keyDeposit": "2000000",
                      "maxCollateralInputs": 0,
                      "minFeeCoefficient": 44,
                      "minFeeConstant": 155381,
                      "minPoolCost": "340000000",
                      "poolDeposit": "500000000",
                      "protocol": 4
                    }
                }
            }
  - name: "Construction payloads test with stake key registration"
    flow:
      - post:
          url: '/construction/payloads'
          body: |
            {
                "network_identifier": {
                    "blockchain": "cardano",
                    "network": "preprod"
                },
                "operations": [
                    {
                        "operation_identifier": {
                            "index": 0,
                            "network_index": 0
                        },
                        "type": "input",
                        "status": "success",
                        "account": {
                            "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                        },
                        "amount": {
                            "value": "-9000000",
                            "currency": {
                                "symbol": "ADA",
                                "decimals": 6
                            }
                        },
                        "coin_change": {
                            "coin_identifier": {
                                "identifier": "2f23fd8cca835af21f3ac375bac601f97ead75f2e79143bdf71fe2c4be043e8f:1"
                            },
                            "coin_action": "coin_spent"
                        }
                    },
                    {
                        "operation_identifier": {
                            "index": 1
                        },
                        "related_operations": [
                            {
                                "index": 0
                            }
                        ],
                        "type": "output",
                        "status": "success",
                        "account": {
                            "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                        },
                        "amount": {
                            "value": "10000",
                            "currency": {
                                "symbol": "ADA",
                                "decimals": 6
                            }
                        }
                    },
                    {
                        "operation_identifier": {
                            "index": 2
                        },
                        "related_operations": [
                            {
                                "index": 0
                            }
                        ],
                        "type": "output",
                        "status": "success",
                        "account": {
                            "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                        },
                        "amount": {
                            "value": "40000",
                            "currency": {
                                "symbol": "ADA",
                                "decimals": 6
                            }
                        }
                    },
                    {
                        "operation_identifier": {
                            "index": 3
                        },
                        "type": "stakeKeyRegistration",
                        "status": "success",
                        "account": {
                            "address": "stake1uxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7caek7a5"
                        },
                        "metadata": {
                            "staking_credential": {
                                "hex_bytes": "1B400D60AAF34EAF6DCBAB9BBA46001A23497886CF11066F7846933D30E5AD3F",
                                "curve_type": "edwards25519"
                            }
                        }
                    }
                ],
                "metadata": {
                    "ttl": "1000",
                    "protocol_parameters": {
                      "coinsPerUtxoSize": "0",
                      "maxTxSize": 16384,
                      "maxValSize": 0,
                      "keyDeposit": "2000000",
                      "maxCollateralInputs": 0,
                      "minFeeCoefficient": 44,
                      "minFeeConstant": 155381,
                      "minPoolCost": "340000000",
                      "poolDeposit": "500000000",
                      "protocol": 4
                    }
                }
            }
  - name: "Construction preprocess simple test"
    flow:
      - post:
          url: '/construction/preprocess'
          body: |
            {
              "metadata": {
                "deposit_parameters": {
                  "poolDeposit": "500000000",
                  "keyDeposit": "2000000"
                }
              },
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "operations": [
                {
                  "operation_identifier": {
                    "index": 0,
                    "network_index": 0
                  },
                  "type": "input",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "-90000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  },
                  "coin_change": {
                    "coin_identifier": {
                      "identifier": "2f23fd8cca835af21f3ac375bac601f97ead75f2e79143bdf71fe2c4be043e8f:1"
                    },
                    "coin_action": "coin_spent"
                  }
                },
                {
                  "operation_identifier": {
                    "index": 1
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "10000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 2
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "40000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                }
              ]
            }
  - name: "Construction preprocess pool registration test"
    flow:
      - post:
          url: '/construction/preprocess'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "metadata": {
                "relative_ttl": 100,
                "deposit_parameters": {
                  "poolDeposit": "500000000",
                  "keyDeposit": "2000000"
                }
              },
              "operations" : [
                {
                  "operation_identifier": {
                    "index": 0,
                    "network_index": 0
                  },
                  "type": "input",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "-90000000000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  },
                  "coin_change": {
                    "coin_identifier": {
                      "identifier": "2f23fd8cca835af21f3ac375bac601f97ead75f2e79143bdf71fe2c4be043e8f:1"
                    },
                    "coin_action": "coin_spent"
                  }
                },
                {
                  "operation_identifier": {
                    "index": 1
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "10000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 2
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "40000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 3
                  },
                  "type": "poolRegistration",
                  "status": "success",
                  "account": {
                    "address": "1b268f4cba3faa7e36d8a0cc4adca2096fb856119412ee7330f692b5"
                  },
                  "metadata": {
                    "poolRegistrationParams": {
                      "vrfKeyHash": "8dd154228946bd12967c12bedb1cb6038b78f8b84a1760b1a788fa72a4af3db0",
                      "rewardAddress": "stake1uxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7caek7a5",
                      "pledge": "5000000",
                      "cost": "3000000",
                      "poolOwners": ["stake1uxly0q2cnpxrjrqm9vpnr9dwkr0j945gulhhgs3dx33l47sweg9er"],
                      "relays": [
                        {
                          "type": "single_host_addr",
                          "ipv4": "127.0.0.1",
                          "ipv6": "2345:0425:2ca1:0000:0000:0567:5673:23b5",
                          "port": "32"
                        }
                      ],
                      "margin": {
                        "numerator": "1",
                        "denominator": "1"
                      },
                      "poolMetadata": {
                        "url": "poolMetadataUrl",
                        "hash": "9ac2217288d1ae0b4e15c41b58d3e05a13206fd9ab81cb15943e4174bf30c90b"
                      }
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 3
                  },
                  "type": "stakeDelegation",
                  "status": "success",
                  "account": {
                    "address": "stake1uxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7caek7a5"
                  },
                  "metadata": {
                    "staking_credential": {
                      "hex_bytes": "1B400D60AAF34EAF6DCBAB9BBA46001A23497886CF11066F7846933D30E5AD3F",
                      "curve_type": "edwards25519"
                    },
                    "pool_key_hash": "1b268f4cba3faa7e36d8a0cc4adca2096fb856119412ee7330f692b5"
                  }
                }
              ]
            }
  - name: "Construction preprocess two withdrawals and key registration test"
    flow:
      - post:
          url: '/construction/preprocess'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "metadata": {
                "relative_ttl": 100,
                "deposit_parameters": {
                  "poolDeposit": "500000000",
                  "keyDeposit": "2000000"
                }
              },
              "operations" : [
                {
                  "operation_identifier": {
                    "index": 0,
                    "network_index": 0
                  },
                  "type": "input",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "-9000000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  },
                  "coin_change": {
                    "coin_identifier": {
                      "identifier": "2f23fd8cca835af21f3ac375bac601f97ead75f2e79143bdf71fe2c4be043e8f:1"
                    },
                    "coin_action": "coin_spent"
                  }
                },
                {
                  "operation_identifier": {
                    "index": 1
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "10000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 2
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "40000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 3
                  },
                  "type": "stakeKeyRegistration",
                  "status": "success",
                  "account": {
                    "address": "stake1uxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7caek7a5"
                  },
                  "metadata": {
                    "staking_credential": {
                      "hex_bytes": "1B400D60AAF34EAF6DCBAB9BBA46001A23497886CF11066F7846933D30E5AD3F",
                      "curve_type": "edwards25519"
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 4
                  },
                  "type": "withdrawal",
                  "status": "success",
                  "account": {
                    "address": "stake1uxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7caek7a5"
                  },
                  "amount": {
                    "value": "10000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  },
                  "metadata": {
                    "staking_credential": {
                      "hex_bytes": "1B400D60AAF34EAF6DCBAB9BBA46001A23497886CF11066F7846933D30E5AD3F",
                      "curve_type": "edwards25519"
                    }
                  }
                }
              ]
            }
  - name: "Construction metadata test"
    flow:
      - post:
          url: '/construction/metadata'
          body: |
            {
                "network_identifier": {
                    "blockchain": "cardano",
                    "network": "preprod"
                },
                "options": {
                    "transaction_size": {{ transaction_size }},
                    "relative_ttl": {{ relative_ttl }}
                }
            }
  - name: "Construction hash test"
    flow:
      - post:
          url: '/construction/hash'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "signed_transaction": "{{ signed_hash_transaction }}"
            }
  - name: "Construction derive test"
    flow:
      - post:
          url: '/construction/derive'
          body: |
            {
                "network_identifier": {
                    "blockchain": "cardano",
                    "network": "preprod"
                },
                "public_key": {
                    "hex_bytes": "{{ hex_bytes }}",
                    "curve_type": "edwards25519"
                },
                "metadata": {
                    "address_type": "Base",
                    "staking_credential": {
                      "hex_bytes": "43d39a2ac216e5468d4f19541c204df47a7721c4f3b0b40dc6d290e53cb45ffe",
                      "curve_type": "edwards25519"
                    }
                }
            }